Revit 2027 API
DimensionType.SetEqualityFormula Method
 Sets an ordered list of the entries to use in the equality formula definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting> formattingArr
)
Public Sub SetEqualityFormula (
	formattingArr As IList(Of DimensionEqualityLabelFormatting)
)
public:
void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting^>^ formattingArr
)
member SetEqualityFormula :
        formattingArr : IList<DimensionEqualityLabelFormatting> -> unit
Parameters
formattingArr IList<DimensionEqualityLabelFormatting>
 An ordered list of the entries to use in the equality formula definition.
Exceptions
Exception | Condition
ArgumentException |  The input equality formula entries are not valid for use in the given DimensionType.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace